Examples/ConservativeDBSPaper/DNS/microChannel_500_150_1/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2512                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    outlet
    {
        type            patch;
        nFaces          80;
        startFace       127120;
    }
    inlet
    {
        type            patch;
        nFaces          80;
        startFace       127200;
    }
    upperWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          800;
        startFace       127280;
    }
    lowerWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          800;
        startFace       128080;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          128000;
        startFace       128880;
    }
)

// ************************************************************************* //
