Examples/ConservativeDBSPaper/DNS/microChannel_500_150_1/0_orig/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type    fixedValue;
        value   uniform PDROP;
    }

    outlet
    {
        type    fixedValue;
        value   uniform 0;
    }

    lowerWall
    {
        type    zeroGradient;
    }

    upperWall
    {
        type    zeroGradient;
    }

    frontAndBack
    {
        type    empty;
    }
}
// ************************************************************************* //
